In [325]:
import pandas as pd
import numpy as np

# 5.1 Introduction to pandas Data Structures

### Series

In [264]:
obj = pd.Series([4, 7, -5, 3])

In [265]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [266]:
obj = pd.Series([4, 7, -5, 3])

And so on...

In [267]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [268]:
print(sdata)

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

hm...this appears to not be working.

In [269]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

In [270]:
obj2 = pd.Series([4,7,-5,3], index=['d','b', 'a', 'c'])

In [271]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [272]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [273]:
obj2['a']

-5

In [274]:
obj2[obj2 > 0]

d    4
b    7
c    3
dtype: int64

In [275]:
obj2 * 2

d     8
b    14
a   -10
c     6
dtype: int64

In [276]:
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [277]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = pd.Series(sdata, index=states)

In [278]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [279]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [280]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [281]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [282]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [283]:
obj + obj4

0            NaN
1            NaN
2            NaN
3            NaN
California   NaN
Ohio         NaN
Oregon       NaN
Texas        NaN
dtype: float64

In [284]:
obj4.name = 'population'

In [285]:
obj4.index.name = 'state'

In [286]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

Okay, so I see here that the names I declared put but into the bottom...cool

In [287]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']

In [288]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [289]:
data = {'state': ['Ohio','Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
'year': [2000, 2001,2002,2001,2002,2003],
'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

In [290]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

Impressive! I just made a very small dataframe?? It is nice to see it come to life....

In [291]:
pop = {'Nevada': {2001:2.4,2002:2.9},
"Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [292]:
frame3 = pd.DataFrame(pop)

In [293]:
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [294]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])

In [295]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

Above, this indexed the values with designation. THIS IS 5.2 - 'RE-INDEXING'

In [296]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])

In [297]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [298]:
new_obj = obj2.drop('c')

In [299]:
new_obj

a   -5.3
b    7.2
d    4.5
e    NaN
dtype: float64

This above, is me dropping an index. I dropped c and renamed it new_obj

In [300]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])

In [301]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [302]:
obj['b']

1.0

In [303]:
obj[1]

1.0

In [304]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [305]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [306]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

Above, I am finding a range from index b to c

In [307]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])

In [308]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [309]:
obj = pd.Series([4,7,-3,2])

In [310]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

Above, I am sorting values with the object function.

In [311]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
[np.nan, np.nan], [0.75, -1.3]],
index=['a', 'b','c','d'],
columns=['one','two'])

In [312]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [313]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [314]:
df.sum(axis='columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [317]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5], 
                [np.nan, np.nan], [0.75, -1.3]],
                index =['a', 'b', 'c', 'd'],
                columns = ['one', 'two'])

In [318]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [319]:
df.sum

<bound method NDFrame._add_numeric_operations.<locals>.sum of     one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3>

In [320]:
df.sum(axis='columns', skipna=False)

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

SKIPNA will take away those NEGATIVE values.

In [321]:
df.idxmax()

one    b
two    d
dtype: object

idx-max is going to return MAX values..min...does min value

In [322]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [323]:
df.describe

<bound method NDFrame.describe of     one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3>